#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/AWS-Cloud-Fun-Facts-Generator/runs/run-HfMZR43tu51AoZ6V

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=28ae33eca88538c15e57d2fad9ba2be127597941]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_api.funfacts_api will be created
  + resource "aws_apigatewayv2_api" "funfacts_api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "FunfactsAPI"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "CloudFunFacts"
        }

      + cors_configuration {
          + allow_headers = [
              + "Authorization",
              + "Content-Type",
              + "X-Amz-Date",
              + "X-Amz-Security-Token",
              + "X-Api-Key",
            ]
          + allow_methods = [
              + "GET",
              + "OPTIONS",
            ]
          + allow_origins = [
              + "*",
            ]
          + max_age       = 3600
        }
    }

  # aws_apigatewayv2_integration.lambda_integration will be created
  + resource "aws_apigatewayv2_integration" "lambda_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.funfact_route will be created
  + resource "aws_apigatewayv2_route" "funfact_route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /funfact"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.default will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "CloudFunFacts"
        }

      + default_route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = false
          + logging_level            = (known after apply)
          + throttling_burst_limit   = 50
          + throttling_rate_limit    = 100
        }
    }

  # aws_cloudfront_distribution.frontend_cdn will be created
  + resource "aws_cloudfront_distribution" "frontend_cdn" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Component" = "Delivery"
          + "Name"      = "CloudFunFacts-CDN"
        }
      + tags_all                        = {
          + "Component"   = "Delivery"
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "CloudFunFacts-CDN"
          + "Project"     = "CloudFunFacts"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "s3-frontend-origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "s3-frontend-origin"
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_cloudfront_origin_access_control.s3_oac will be created
  + resource "aws_cloudfront_origin_access_control" "s3_oac" {
      + arn                               = (known after apply)
      + description                       = "Managed by Terraform"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "frontend-s3-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # aws_cloudwatch_log_group.lambda_log will be created
  + resource "aws_cloudwatch_log_group" "lambda_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/CloudFunFacts"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "CloudFunFacts"
        }
    }

  # aws_dynamodb_table.cloud_facts will be created
  + resource "aws_dynamodb_table" "cloud_facts" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "FactID"
      + id               = (known after apply)
      + name             = "CloudFacts"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Component"   = "Data-Layer"
          + "Environment" = "dev"
          + "Name"        = "CloudFacts-Database"
        }
      + tags_all         = {
          + "Component"   = "Data-Layer"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "CloudFacts-Database"
          + "Project"     = "CloudFunFacts"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "FactID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_dynamodb_table_item.cloud_facts["1"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "1"
                }
              + FactText = {
                  + S = "AWS S3 was one of the very first AWS services, launched in 2006."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_dynamodb_table_item.cloud_facts["10"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "10"
                }
              + FactText = {
                  + S = "Each AWS Availability Zone has at least one independent power source and cooling system."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_dynamodb_table_item.cloud_facts["11"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "11"
                }
              + FactText = {
                  + S = "Amazon once accidentally took down parts of the internet when S3 had an outage in 2017."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_dynamodb_table_item.cloud_facts["12"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "12"
                }
              + FactText = {
                  + S = "The fastest-growing AWS service is Amazon SageMaker, used for Machine Learning."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_dynamodb_table_item.cloud_facts["13"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "13"
                }
              + FactText = {
                  + S = "The word 'cloud' became popular in the 1990s as a metaphor for the internet."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_dynamodb_table_item.cloud_facts["14"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "14"
                }
              + FactText = {
                  + S = "AWS Lambda can automatically scale from zero to thousands of requests per second."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_dynamodb_table_item.cloud_facts["15"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "15"
                }
              + FactText = {
                  + S = "More data is stored in the cloud today than in all personal computers combined."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_dynamodb_table_item.cloud_facts["2"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "2"
                }
              + FactText = {
                  + S = "Netflix runs almost all of its infrastructure on AWS."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_dynamodb_table_item.cloud_facts["3"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "3"
                }
              + FactText = {
                  + S = "Cloud computing can save companies up to 30% on IT costs."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_dynamodb_table_item.cloud_facts["4"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "4"
                }
              + FactText = {
                  + S = "NASA uses AWS to store and share Mars mission data with the public."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_dynamodb_table_item.cloud_facts["5"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "5"
                }
              + FactText = {
                  + S = "AWS has more than 200 fully featured services today."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_dynamodb_table_item.cloud_facts["6"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "6"
                }
              + FactText = {
                  + S = "The 'cloud' doesn’t float in the sky, it’s made of giant data centers on Earth."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_dynamodb_table_item.cloud_facts["7"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "7"
                }
              + FactText = {
                  + S = "More than 90% of Fortune 100 companies use AWS."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_dynamodb_table_item.cloud_facts["8"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "8"
                }
              + FactText = {
                  + S = "AWS data centers are so secure that they require retina scans and 24/7 guards."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_dynamodb_table_item.cloud_facts["9"] will be created
  + resource "aws_dynamodb_table_item" "cloud_facts" {
      + hash_key   = "FactID"
      + id         = (known after apply)
      + item       = jsonencode(
            {
              + FactID   = {
                  + S = "9"
                }
              + FactText = {
                  + S = "Serverless doesn’t mean there are no servers, it just means you don’t manage them."
                }
            }
        )
      + table_name = "CloudFacts"
    }

  # aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cloud-fun-facts-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "CloudFunFacts"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_basic_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "cloud-fun-facts-lambda-role"
    }

  # aws_iam_role_policy_attachment.lambda_bedrock_access will be created
  + resource "aws_iam_role_policy_attachment" "lambda_bedrock_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonBedrockFullAccess"
      + role       = "cloud-fun-facts-lambda-role"
    }

  # aws_iam_role_policy_attachment.lambda_dynamodb_read will be created
  + resource "aws_iam_role_policy_attachment" "lambda_dynamodb_read" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonDynamoDBReadOnlyAccess"
      + role       = "cloud-fun-facts-lambda-role"
    }

  # aws_lambda_function.cloud_fun_facts will be created
  + resource "aws_lambda_function" "cloud_fun_facts" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./lambda/lambda_function.zip"
      + function_name                  = "CloudFunFacts"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "H6ldaZ6opRqXlAQdm8NUEwqVLU7hTpNKyBptCg+TO7Q="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Component" = "Backend"
          + "Service"   = "FunFacts-API"
        }
      + tags_all                       = {
          + "Component"   = "Backend"
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "CloudFunFacts"
          + "Service"     = "FunFacts-API"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.api_gateway will be created
  + resource "aws_lambda_permission" "api_gateway" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "CloudFunFacts"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.frontend_bucket will be created
  + resource "aws_s3_bucket" "frontend_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Component" = "Frontend"
          + "Name"      = "Frontend-Static-Assets"
        }
      + tags_all                    = {
          + "Component"   = "Frontend"
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "Frontend-Static-Assets"
          + "Project"     = "CloudFunFacts"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.frontend_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "frontend_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "cleanup-old-files"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = false
            }

          + filter {
                # (1 unchanged attribute hidden)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 7
            }
        }
    }

  # aws_s3_bucket_policy.frontend_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "frontend_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # random_id.bucket_id will be created
  + resource "random_id" "bucket_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 33 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_invoke_url             = (known after apply)
  + aws_region                 = "ap-southeast-1"
  + cloudfront_distribution_id = (known after apply)
  + cloudfront_url             = (known after apply)
  + s3_bucket_id               = (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 7 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @ShenLoong99, Action: `pull_request`*